public class HelloJava {  //HelloJava 클래스의 범위 시작

//    <자바 프로그램 실행>강의 섹션 1 3번째 강의
// src-> new-> java class ->HelloJava 입력 ->  HelloJava.java 파일이 만들어진다.
//    자바 프로그램을 코딩한다.
//  psvm이 프로그램이 시작하는 실행시점이 될 수 있다.
    public static void main(String[] args){ //main() 메서드의 범위 시작
        System.out.println("hello world");
//        자바 언어는 대소문자를 구별한다.
//        코드를 분석.
//        지금 단계에서는 이 코드의 모든 내용을 이해할 수 없다.

//        public class HelloJava 알아본다.
//        HelloJava를 클래스라 한다. 클래스는 뒤에서 학습한다.
//        지금은 단순히 HelloJava.java라는 파일을 만들었다고 이해하면 된다.
//        파일명과 클래스 이름이 같아야 한다.
//        {}블록을 사용해서 클래스의 시작과 끝을 나타낸다.

//        psvm 알아본다.
//        main 메서드라 한다. 함수,메서드의 개념을 학습해야 이해할 수 있따. 뒤에서 학습한다.
//        자바는 main(String[] args) 메서드를 찾아서 프로그램을 시작한다.
//        지금은 단순히 main은 프로그램의 시작점이라고 이해하면 된다.
//        {}블록을 사용해서 메서드의 시작과 끝을 나타낸다. []은 배열이다.

//        System.out.println("hello world"); 알아본다.
//        System.out.println(): 값을 콘솔에 출력하는 기능이다.
//        "hello world": 자바는 문자열을 사용할 때 "(쌍따옴표)를 사용한다. 쌍따옴표 사이에 원하는 문자를 감싸면 된다.
//        자바는 문장이 끝날 때 (;)세미콜론을 사용해야 한다.

//        실행과정
//        run(실행) -> 시작지점인 main을 찾는다. -> 한줄씩 위에서 아래로 실행을 한다.->끝이면 프로그램 종료가 된다.
//        블록 예시
//        스페이스 4번으로 구분 해준다. (관례상)
//        블록이 중첩될 때마다 들여쓰기의 깊이가 추가된다. -> 블록안에 코드를 작성하면 스페이스4번 해준다.
    } //main() 머서드의 범위 끝
} //클래스 범위의 끝
