package variable.ex;
// 문제를 스스로 풀기
// 프로그래밍은 머리로 하는 게 아니다.
// 프로그래밍은 수영이나 자전거 타는 거랑 비슷하다
// 아무리 책을 보고 강의 영상을 봐도 직접 물속에 들어가거나 자전거를 타봐야 이해할 수 있다.
// 이해하고 외우는 것도 중요하지만,무엇보다 직접 코딩을 해보는 것이 더욱 중요하다
// 문제를 풀어 보고, 도저히 못 풀겠어 며칠동안 고민을 하고 이러면 안 된다.
// 지금은 문제를 푸는게 중요한게 아니라, 솔직히 뭐가 중요하냐면 코드를 여러번 쳐보고
// 해보는 게 더 중요하다. 머릿속으로 너무 생각하는게 지금은 그렇게 중요한 단계가 아니다
// 개발자들은 일 할 때 구글 창을 띄워놓고 한다.
//원리를 이해하는게 중요하지, 외우는게 중요한 것이 아니다

//문제 1번
// 다음 코드에 반복해서 나오는 숫자 4,3을 다른 숫자로 한번에 변경할 수 있도록 다음을 num1, num2를 사용하도록 변경해보세요.
//System.out.println(4 + 3);
//System.out.println(4 - 3);
//System.out.println(4 * 3);






public class VarEx01Question {
    public static void main(String[] args){
        System.out.println(4 + 3);
        System.out.println(4 - 3);
        System.out.println(4 * 3);
    }
}
