package variable;
// <변수 선언과 초기화>강의 섹션2 강의 3
//변수 선언
// 변수를 선언하면 컴퓨터의 메모리 공간을 확보해서 그곳에 데이터를 저장할 수 있다.
// 그리고 변수의 이름을 통해서 해당 메모리에 접근할 수 있다.
// 쉽게 이야기해서 데이터를 보관할 수 있는 공간을(메모리) 만들고,그곳에 이름을 부여한다.
// int a;
// int b;
// 변수 2개 선언,메모리 공간을 두개 차지한다.
//연달아 변수를 선언하고 싶으면 int c,d; 한번에 여러가지를 선언할 수 있다.
// 4개의 메모리 공간을 차지한다.
// 변수 초기화
// 변수를 선언하고,선언한 변수에 처음으로 값을 저장하는 것을 변수 초기화라고 한다.





public class Var4 {
    public static void main(String[] args) {
        //변수 2개 선언
        int a;
        int b;
        //변수 연달아 2개 선언

        int c,d;


    }
}
